In [1]:
import pandas as pd
import numpy as np

In [2]:
tb = pd.read_csv('../Original Data/tb.csv')
tb.head()

,iso2,year,new_sp,new_sp_m04,new_sp_m514,new_sp_m014,new_sp_m1524,new_sp_m2534,new_sp_m3544,new_sp_m4554,...,new_sp_f04,new_sp_f514,new_sp_f014,new_sp_f1524,new_sp_f2534,new_sp_f3544,new_sp_f4554,new_sp_f5564,new_sp_f65,new_sp_fu
0,AD,1989,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,AD,1990,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,AD,1991,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,AD,1992,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,AD,1993,15.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [3]:
tb.fillna(0, inplace=True)

cols = list(tb.columns[:3]) + [x[7:] for x in tb.columns[3:]]
tb.columns = cols
tb.head()

,iso2,year,new_sp,m04,m514,m014,m1524,m2534,m3544,m4554,...,f04,f514,f014,f1524,f2534,f3544,f4554,f5564,f65,fu
0,AD,1989,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,AD,1990,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,AD,1991,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,AD,1992,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,AD,1993,15.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [4]:
tb.drop('new_sp', axis='columns', inplace=True)
tb.drop('m014', axis='columns', inplace=True)
tb.drop('f014', axis='columns', inplace=True)
tb.drop('mu', axis='columns', inplace=True)
tb.drop('fu', axis='columns', inplace=True)

In [23]:
m_tb = tb.melt(id_vars=["iso2","year"],var_name=["demographic"],value_name="cases")

n_s = ['Male' if x == 'm' else 'Female' for x in m_tb['demographic'].str[0]]
m_tb['sex'] = n_s
m_tb['age'] = m_tb['demographic'].str[1:]
for n, x in enumerate(m_tb['age']):
    if len(x) == 2:
        if x == '65':
            m_tb['age'][n] = '65+'
        else:
            m_tb['age'][n] = '0-4'
m_tb.drop('demographic', axis='columns', inplace=True)
m_tb[m_tb['iso2']==0]

<ipython-input-23-4d15c0e3f6e6>:11: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  m_tb['age'][n] = '0-4'
<ipython-input-23-4d15c0e3f6e6>:9: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  m_tb['age'][n] = '65+'

      iso2  year  cases     sex  age
3691     0  1985    0.0    Male  0-4
3692     0  1986    0.0    Male  0-4
3693     0  1987    0.0    Male  0-4
3694     0  1988    0.0    Male  0-4
3695     0  1989    0.0    Male  0-4
...    ...   ...    ...     ...  ...
90244    0  2004   74.0  Female  65+
90245    0  2005   91.0  Female  65+
90246    0  2006   80.0  Female  65+
90247    0  2007   76.0  Female  65+
90248    0  2008   80.0  Female  65+

[368 rows x 5 columns]

In [24]:
p_table = pd.pivot_table(m_tb, values='cases', index=['iso2', 'year', 'age', 'sex'])

In [25]:
p_table.head(30)

                       cases
iso2 year age  sex
0    1985 0-4  Female    0.0
               Male      0.0
          1524 Female    0.0
               Male      0.0
          2534 Female    0.0
               Male      0.0
          3544 Female    0.0
               Male      0.0
          4554 Female    0.0
               Male      0.0
          514  Female    0.0
               Male      0.0
          5564 Female    0.0
               Male      0.0
          65+  Female    0.0
               Male      0.0
     1986 0-4  Female    0.0
               Male      0.0
          1524 Female    0.0
               Male      0.0
          2534 Female    0.0
               Male      0.0
          3544 Female    0.0
               Male      0.0
          4554 Female    0.0
               Male      0.0
          514  Female    0.0
               Male      0.0
          5564 Female    0.0
               Male      0.0